MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32FG1V232F256GM48/mcu.h
  uint32_t       RESERVED16[2U];      /**< Reserved for future use **/
  __IOM uint32_t LFAPRESC0;           /**< Low Frequency a Prescaler Register 0 (Async Reg)  */
  uint32_t       RESERVED17[1U];      /**< Reserved for future use **/
  __IOM uint32_t LFBPRESC0;           /**< Low Frequency B Prescaler Register 0  (Async Reg)  */
  uint32_t       RESERVED18[1U];      /**< Reserved for future use **/
  __IOM uint32_t LFEPRESC0;           /**< Low Frequency E Prescaler Register 0  (Async Reg)  */

  uint32_t       RESERVED19[3U];      /**< Reserved for future use **/
  __IM uint32_t  SYNCBUSY;            /**< Synchronization Busy Register  */
  __IOM uint32_t FREEZE;              /**< Freeze Register  */
  uint32_t       RESERVED20[2U];      /**< Reserved for future use **/
  __IOM uint32_t PCNTCTRL;            /**< PCNT Control Register  */

  uint32_t       RESERVED21[2U];      /**< Reserved for future use **/
  __IOM uint32_t ADCCTRL;             /**< ADC Control Register  */

  uint32_t       RESERVED22[4U];      /**< Reserved for future use **/
  __IOM uint32_t ROUTEPEN;            /**< I/O Routing Pin Enable Register  */
  __IOM uint32_t ROUTELOC0;           /**< I/O Routing Location Register  */

  uint32_t       RESERVED23[2U];      /**< Reserved for future use **/
  __IOM uint32_t LOCK;                /**< Configuration Lock Register  */
} CMU_TypeDef;                        /** @} */

// #include "efr32fg1v_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_prs_ch.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFR32FG1V232F256GM48_PRS PRS
 * @{
 * @brief EFR32FG1V232F256GM48_PRS Register Declaration
 ******************************************************************************/
/** PRS Register Declaration */
typedef struct {
  __IOM uint32_t SWPULSE;       /**< Software Pulse Register  */
  __IOM uint32_t SWLEVEL;       /**< Software Level Register  */
  __IOM uint32_t ROUTEPEN;      /**< I/O Routing Pin Enable Register  */
  uint32_t       RESERVED0[1U]; /**< Reserved for future use **/
  __IOM uint32_t ROUTELOC0;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC1;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC2;     /**< I/O Routing Location Register  */

  uint32_t       RESERVED1[1U]; /**< Reserved for future use **/
  __IOM uint32_t CTRL;          /**< Control Register  */
  __IOM uint32_t DMAREQ0;       /**< DMA Request 0 Register  */
  __IOM uint32_t DMAREQ1;       /**< DMA Request 1 Register  */
  uint32_t       RESERVED2[1U]; /**< Reserved for future use **/
  __IM uint32_t  PEEK;          /**< PRS Channel Values  */

  uint32_t       RESERVED3[3U]; /**< Reserved registers */
  PRS_CH_TypeDef CH[12U];       /**< Channel registers */
} PRS_TypeDef;                  /** @} */

// #include "efr32fg1v_ldma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_fpueh.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_timer.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_usart.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_adc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg1v_romtable.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFR32FG1V232F256GM48_Peripheral_TypeDefs  */

/***************************************************************************//**
 * @defgroup EFR32FG1V232F256GM48_Peripheral_Base Peripheral Memory Map
 * @{
 ******************************************************************************/

#define MSC_BASE          (0x400E0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400E3000UL) /**< EMU base address  */
#define RMU_BASE          (0x400E5000UL) /**< RMU base address  */
#define CMU_BASE          (0x400E4000UL) /**< CMU base address  */
#define CRYPTO_BASE       (0x400F0000UL) /**< CRYPTO base address  */
#define GPIO_BASE         (0x4000A000UL) /**< GPIO base address  */
#define PRS_BASE          (0x400E6000UL) /**< PRS base address  */
#define LDMA_BASE         (0x400E2000UL) /**< LDMA base address  */
#define FPUEH_BASE        (0x400E1000UL) /**< FPUEH base address  */
#define GPCRC_BASE        (0x4001C000UL) /**< GPCRC base address  */
#define TIMER0_BASE       (0x40018000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40018400UL) /**< TIMER1 base address  */
#define USART0_BASE       (0x40010000UL) /**< USART0 base address  */
#define USART1_BASE       (0x40010400UL) /**< USART1 base address  */
#define LEUART0_BASE      (0x4004A000UL) /**< LEUART0 base address  */
#define LETIMER0_BASE     (0x40046000UL) /**< LETIMER0 base address  */
#define CRYOTIMER_BASE    (0x4001E000UL) /**< CRYOTIMER base address  */
#define I2C0_BASE         (0x4000C000UL) /**< I2C0 base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define RTCC_BASE         (0x40042000UL) /**< RTCC base address  */
#define WDOG0_BASE        (0x40052000UL) /**< WDOG0 base address  */
#define DEVINFO_BASE      (0x0FE081B0UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xE00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

